ori = """1.	是我家雨琦。
2.	雨琦演的广告，我们在学校看过，就是老师给我们放电影时候看的
3.	虽然我不喜欢看广告，但是宋雨琦的广告我真的爱看呀
4.	你们太会选代言人了吧@脉动
5.	我们体育老师体育课给我们放电影，我们班好多男同学说：这个女人真美，我们班的女同学都认识宋雨琦
6.	以后之喝脉动
7.	买饮料送不送代言人？
8.	现在就去订购
9.	雨琦
10.	哦，天呐，有一句话，雨琦的声音不是那样的。
11.	我就爱雨琪
12.	雨琦！可爱
13.	看过了
14.	雨琦
15.	我同学看到这条广告直接哭了。上课看开心锤锤的时候。
16.	特别好喝。尤其是柠檬味的。
17.	我买了五大行天天在家喝。
18.	宋雨琦！
19.	送我一个代言人
20.	哇塞哇塞，宝宝好美啊，买脉动送我一个雨琪宝宝吧
21.	@卡布叻_盐汽水味的🍟 啊哈哈哈，代言的就是我喜欢喝的水！！！
22.	买的举手
23.	阿脉，我们这还没有
24.	买5000箱
25.	雨琦
26.	等我，去买两箱！
27.	以后只喝脉动
28.	好久没喝了，这下不得不又喝起来了
29.	我只要汽水的轻松~
30.	好爱送你琦呀
31.	我家雨琦代言的东西一定要买
32.	我要端箱
33.	因为和雨琦联动，我要端箱
34.	雨琦！
35.	你被我盯上了脉动[捂嘴笑R]
36.	品牌方找对人啦
37.	以后就喝脉动
38.	必须只喝脉动
39.	由于我们班看动漫的时候看到了这个广告，所以我们班每次运动的时候就会说：＂脉动救我～＂
40.	太好了，是雨琦，我们有救啦
41.	有坐一起带白的，我要喝。
42.	我们学校中午吃饭时让看电视，每次都有广告，这样能看见雨琦了！！！开心开心
43.	那么好，那我以后只喝脉动。
44.	难怪我最近在电视上还看到了宋雨琦，我当时以为我眼花了呢。
45.	从现在开始我只喝脉动
46.	立马下单脉动
47.	@🌷林淮🌷 宋雨琦
48.	我唯一爱看的广告(Because有雨琦)
49.	脉动你终于有实力了太有实力了，我喝你一辈子
50.	必须买
51.	Ok，以后就喝脉动
52.	曲琦以后要喝什么饮料了吗？
53.	脉动啊！你可真会选，选到我家主子了
54.	以后饮料只喝脉动了
55.	买了三箱
56.	脉动你是知道找谁的
57.	脉动眼光真好
58.	지금부터 나는 맥동만 마신다.
59.	雨琦超帅
60.	行了，我现在天天都要买了
61.	太好了，是雨琪弄的，我没有救啦
62.	这个是真的，不买不行
63.	@一只鸡腿 周六必买
64.	雨琦姐姐！！！
65.	@筱果冻（稻米） @李闫 @辞忧 咱班老师说好的给我咱买脉动奥我担代言的
66.	呜我也要
67.	我中了！！
68.	我担好美
69.	我推宋雨琦，
70.	好看
71.	什么东西？我家宋雨琦代言脉动了！！
72.	@筱果冻（稻米） @李闫 @辞忧 哇塞我雨琦代言脉动啦
73.	可以啊，雨琦印在包装上吗？
74.	尝尝青草味的 代言人好美
75.	官方太用心了。雨琦造型好美。
76.	买脉动送不送代言人
77.	我买一瓶脉动，能把雨琦买过来吗？
78.	支持脉动品牌代言人宋雨琦
79.	我推。
80.	第一眼广告，不看。第二眼雨琦，直接看完。
81.	**一个关于和代言人结婚的表情包**
82.	买脉动送不送代言人呀
83.	逼我买脉动？宋雨琦你不要小看你的魅力了
84.	谁懂 我现在就在喝
85.	哇~
86.	宋雨旑
87.	雨琦♥
88.	买脉动能送雨琦吗
89.	雨琦
90.	我要买六箱啊，买脉动。之后呢，里面有宋雨琦。
91.	直接叫他宋雨琦来我家。
92.	太好了，是雨琦我们有救了
93.	我家琦宝真好看哦
94.	我们学校就有
95.	@披萨🍕 @ID.总裁荞麦面 @终焉
96.	宋雨琦！！！+一个关于代言人的大头照
97.	第1次看广告都这么津津有味
98.	太爱脉动了
99.	我同学看到这条广告直接哭了。上课看开心锤锤的时候。
100.	感覺可以買100箱喔
101.	我宣布麦冬将成为我的新宠。
102.	我觉得可以叫我妈买两箱
103.	如果是雨琦打的广告哈，那我就必须喝
104.	@宋雨琦_G-I-DLE 你真好看
105.	脉动，你等我，我去抢1000箱
106.	雨琦？
107.	哇偶
108.	我们在学校看电影的时候广告也出来这个了，那时候我看到宋雨琦激动了好久
109.	我去！雨琦！曲奇们！快来！
1.	雨琦
2.	必须2这个
3.	买这个脉动上面会有宋雨琦的联动吗？
4.	宋雨琪我喜欢。
5.	太帅了
6.	居然代言脉动了必须买五箱
7.	不是雨琦本来就会。
8.	雨琦弟弟？直接买一箱
9.	雨琦
10.	宋雨琦什么时候拍
11.	买
12.	那里，雨琦很厉害的，不可能扔不进
13.	雨琦代言的我直接买一车
14.	雨琦！
15.	我滴妈，代言真是一个一个接啊
16.	666
17.	好帅 好可爱
18.	雨琦的代言必须支持
19.	雨琦好帅
20.	这个味道很好喝
21.	好美
22.	我春游买的同款
23.	好美
24.	学姐教我
25.	可爱可爱
26.	笑死我了啊啊有我们学校4.25我会去看的
27.	篮球小狗
28.	雨琦 好米
29.	还有变装真不错
30.	宝宝
31.	雨琦宝宝
32.	雨琦厉害 脉动回来
33.	太很快了吧
34.	来瓶脉动 状态一键回来
35.	一起脉动起来
36.	好帅
37.	好耶！是篮球琦琦
38.	假装投篮不进的琦琦哈哈哈
39.	三岁就会打篮球
40.	哇哦
41.	好厉害的宋雨琦
42.	脉脉我听不到雨琦声音
43.	好美
44.	今天刚到货试了下柚橘和桃子的
45.	哦这款还没喝过，等青草喝完试一试这个造型最喜欢了
46.	好美
47.	雨琦学姐可以教我打篮球吗
48.	雨琦好阳光
49.	我的老公
50.	我来占位了，雨琦好美
51.	脉脉
52.	脉脉可以让代言人教我打篮球嘛
53.	怎样加入代言人雨琦的战队
54.	这款好喝吗？之前买的还没喝完，要不喝完尝尝
55.	雨琦这个造型超漂亮的！
56.	好帅
57.	宝宝
58.	wow 好美的脉动代言人
59.	三岁就会打篮球的琦宝
60.	好漂酿
61.	雨琦妹妹好漂亮
62.	这代言人太美了
63.	太厉害了雨琦宝宝
64.	代言人太美啦
65.	哇@宋雨琦_G-I-DLE
66.	哇塞
67.	美美的 这个发带和衣服太好看了有链接吗
68.	好少年气息！！！
69.	雨琦联名的必须买一箱
70.	**一张代言人穿着与视频同款的 Mizone 455 蓝色衣服在夜晚的海边的图片** (好美)
71.	**一个关于和代言人结婚的表情包**
72.	谁家雨琦最好看？
73.	代言人宋雨琦太美啦+一个代言人穿着蓝色半透明裙子的图片
74.	脉脉可以让代言人教我打篮球吗+一个代言人穿着蓝色半透明裙子的图片
75.	@祈羽铃颂（曲琦） (回复: 我已经喝上了)
76.	@念渔Aa @＾娜水音🥥 妈呀帅死我了
77.	瓶子上面印着一个雨琦，我天天喝。+一个抽象的用于表达对代言人喜爱的表情包
78.	我打篮球喝了好好喝
79.	我去，以后除了脉动，其他的饮料有我一律不喝
80.	我今天去买一箱
81.	我要买100箱
82.	告诉我这个品牌在哪买
83.	好美
84.	美神。。
85.	**一个眼睛放光嘴巴张开表示很赞叹的表情包** (好美)
86.	**一个代言人比心的表情包** (比心)
87.	我靠
88.	雨琦宝宝我爱你
89.	那我得多买几箱了
90.	第一眼：什麼廣告 第二眼：哇雨琦買一个
91.	买一瓶脉动送一个宋雨琦吗？
92.	**一个关于和代言人结婚的表情包**
93.	厉害
94.	**一张代言人穿着与视频同款的 Mizone 455 蓝色衣服在夜晚的海边的照片** (好美)
95.	最纯爱那年是宋雨琦代言的东西，我都会疯狂买（好吧，其实现在也是
96.	买一瓶送代言人吗？
97.	**一个由网友魔改的代言人比心的有点抽象的表情** (比心)
98.	雨琦代言的必须多买点
99.	我买一瓶代言人可以送给我吗
100.	**一个赞的表情** (赞)
101.	**一张代言人穿着与视频同款的 Mizone 455 蓝色衣服在夜晚的海边的照片** (好美)
102.	**一个赞的表情** (赞)
103.	太美了
104.	好漂亮的代言人啊
105.	给个链接吧
106.	宋雨琦做得好
107.	**一个赞的表情** (赞)
108.	雨琦美美哒
109.	漂亮
"""

ori = [i.split() for i in ori.split("\n")]

ori2 = []
for i in ori:
    if len(i) > 0:
        ori2.append(i[1])

for i in ori2:
    print(f'"{i}",')
